# Conductor Material Dispose Method

Source: https://www.revitapidocs.com/2026/4ffe92b7-6bb5-1fdb-ae9d-8ec6f6af546a.htm

---

| Conductor Material Dispose Method |
| --- |

Releases all resources used by the ConductorMaterial
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace